{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Features"
        ],
        "output": [
          "Features0"
        ],
        "name": "Scaler",
        "opType": "Scaler",
        "attribute": [
          {
            "name": "offset",
            "floats": [
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "scale",
            "floats": [
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Label"
        ],
        "output": [
          "LabelEncoderOutput"
        ],
        "name": "LabelEncoder",
        "opType": "LabelEncoder",
        "attribute": [
          {
            "name": "keys_strings",
            "strings": [
              "NQ==",
              "Mw==",
              "Ng==",
              "NA==",
              "OA==",
              "MQ==",
              "Mg==",
              "Nw==",
              "MTA=",
              "OQ=="
            ],
            "type": "STRINGS"
          },
          {
            "name": "default_int64",
            "i": "-1",
            "type": "INT"
          },
          {
            "name": "values_int64s",
            "ints": [
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "LabelEncoderOutput"
        ],
        "output": [
          "Label0"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "12",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "PredictedLabelInt64",
          "Score"
        ],
        "name": "LinearClassifier",
        "opType": "LinearClassifier",
        "attribute": [
          {
            "name": "post_transform",
            "s": "U09GVE1BWA==",
            "type": "STRING"
          },
          {
            "name": "multi_class",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "coefficients",
            "floats": [
              -0.08653142,
              0.20890681,
              0.74743676,
              0.36537486,
              -0.37863967,
              -0.6860343,
              0,
              -0.55670774,
              -0.38455516,
              -1.2925535,
              0,
              0,
              -0.47903028,
              -0.08692356,
              -0.54871917,
              0,
              0.62971586,
              0,
              0,
              0,
              0.07289206,
              0.17159398,
              0.69370115,
              0,
              0,
              -0.6188946,
              0,
              -0.731503,
              -0.7182458,
              0.26087597,
              -0.46723992,
              -0.24964823,
              1.0183021,
              0.7931943,
              0,
              0,
              0.8071691,
              0,
              0.83375245,
              0,
              -1.6738002,
              -1.1952196,
              -0.5542594,
              -0.57002735,
              -0.7317195,
              -0.5464471,
              -0.7487077,
              0,
              -0.5652242,
              -0.9906595,
              -0.23805667,
              0,
              -0.8203234,
              -0.093711294,
              -0.4533303,
              0,
              0,
              0,
              0.72640705,
              0,
              1.12283,
              0.32389992,
              0.24602911,
              0.07847004,
              0.9396568,
              0.9220664,
              0,
              0,
              1.10286,
              0.7049758,
              0,
              0.32242095,
              0.50384295,
              1.302928,
              0,
              0.86218894,
              0.015431382,
              0,
              0.19367976,
              0.26258472
            ],
            "type": "FLOATS"
          },
          {
            "name": "intercepts",
            "floats": [
              1.2362208,
              1.6875601,
              -0.8095312,
              1.3560044,
              -1.5976171,
              2.5731874,
              1.0314587,
              -1.6772784,
              -1.4065255,
              -2.3934383
            ],
            "type": "FLOATS"
          },
          {
            "name": "classlabels_ints",
            "ints": [
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "PredictedLabelInt64"
        ],
        "output": [
          "PredictedLabel"
        ],
        "name": "Cast0",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "12",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Label0"
        ],
        "output": [
          "Label1"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "Features1"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "PredictedLabel"
        ],
        "output": [
          "PredictedLabel0"
        ],
        "name": "Identity1",
        "opType": "Identity"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "Score0"
        ],
        "name": "Identity2",
        "opType": "Identity"
      }
    ],
    "name": "model",
    "input": [
      {
        "name": "Label",
        "type": {
          "tensorType": {
            "elemType": 8,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Label1",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features1",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel0",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "10"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Features0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label0",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "9"
    }
  ]
}