{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Features"
        ],
        "output": [
          "Features0"
        ],
        "name": "Imputer",
        "opType": "Imputer",
        "attribute": [
          {
            "name": "replaced_value_float",
            "f": "NaN",
            "type": "FLOAT"
          },
          {
            "name": "imputed_value_floats",
            "floats": [
              0
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "Features1"
        ],
        "name": "Scaler",
        "opType": "Scaler",
        "attribute": [
          {
            "name": "offset",
            "floats": [
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "scale",
            "floats": [
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Label"
        ],
        "output": [
          "LabelEncoderOutput"
        ],
        "name": "LabelEncoder",
        "opType": "LabelEncoder",
        "attribute": [
          {
            "name": "keys_strings",
            "strings": [
              "Mw==",
              "OA==",
              "MQ==",
              "NQ==",
              "Mg==",
              "MTA=",
              "Ng==",
              "NA==",
              "Nw==",
              "OQ=="
            ],
            "type": "STRINGS"
          },
          {
            "name": "default_int64",
            "i": "-1",
            "type": "INT"
          },
          {
            "name": "values_int64s",
            "ints": [
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "LabelEncoderOutput"
        ],
        "output": [
          "Label0"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "12",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Features1"
        ],
        "output": [
          "Labels",
          "Score"
        ],
        "name": "LinearClassifier",
        "opType": "LinearClassifier",
        "attribute": [
          {
            "name": "post_transform",
            "s": "U09GVE1BWA==",
            "type": "STRING"
          },
          {
            "name": "multi_class",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "coefficients",
            "floats": [
              -0.5040307,
              -1.18665814,
              0,
              0,
              -0.4745431,
              -0.0457207263,
              -0.609427869,
              0,
              0.945539951,
              0.9072637,
              -0.146731973,
              0,
              0.595698357,
              0,
              0.924152553,
              0,
              -1.64307475,
              -1.12142336,
              -0.43682757,
              -0.514539361,
              -0.984152853,
              -0.6729761,
              -0.711649537,
              0,
              -0.0447186679,
              0.138106227,
              0.705147862,
              0.331640273,
              -0.329754144,
              -0.7123607,
              0,
              -0.46727252,
              -0.543338358,
              -1.06657445,
              -0.1826125,
              0,
              -0.6470364,
              -0.11790736,
              -0.4401821,
              0,
              0.9442133,
              0.9040651,
              0,
              0,
              1.12141752,
              0.6733171,
              0,
              0.36669904,
              0.49009648,
              0,
              0.277017027,
              0,
              0.0377836041,
              0.272689134,
              0.7089771,
              0,
              0,
              -0.626159668,
              0,
              -0.5391268,
              -0.635246456,
              0.100393988,
              -0.299498081,
              -0.256104,
              0,
              0,
              0.520324647,
              0,
              1.26542234,
              0.33962968,
              0.313578337,
              0.06361275,
              0.5025945,
              1.28040659,
              0,
              0.8730278,
              0.06072715,
              0,
              0.1766175,
              0.272789866
            ],
            "type": "FLOATS"
          },
          {
            "name": "intercepts",
            "floats": [
              1.73919559,
              -1.43502069,
              2.63000965,
              1.271419,
              0.9587243,
              -1.40365088,
              -0.89705795,
              1.27946162,
              -1.76300251,
              -2.38004065
            ],
            "type": "FLOATS"
          },
          {
            "name": "classlabels_ints",
            "ints": [
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Labels"
        ],
        "output": [
          "CastNodeOutput"
        ],
        "name": "Unsqueeze",
        "opType": "Unsqueeze",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "CastNodeOutput"
        ],
        "output": [
          "PredictedLabel"
        ],
        "name": "Cast0",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "12",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Label0"
        ],
        "output": [
          "Label.output"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "Features1"
        ],
        "output": [
          "Features.output"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "PredictedLabel"
        ],
        "output": [
          "PredictedLabel.output"
        ],
        "name": "Identity1",
        "opType": "Identity"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "Score.output"
        ],
        "name": "Identity2",
        "opType": "Identity"
      },
      {
        "input": [
          "mlnet.Score.SlotNames"
        ],
        "output": [
          "mlnet.Score.unusedOutput"
        ],
        "name": "mlnet.Score.SlotNames",
        "opType": "LabelEncoder",
        "attribute": [
          {
            "name": "keys_strings",
            "strings": [
              "Mw==",
              "OA==",
              "MQ==",
              "NQ==",
              "Mg==",
              "MTA=",
              "Ng==",
              "NA==",
              "Nw==",
              "OQ=="
            ],
            "type": "STRINGS"
          },
          {
            "name": "values_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      }
    ],
    "name": "model",
    "initializer": [
      {
        "dims": [
          "1",
          "1"
        ],
        "dataType": 8,
        "stringData": [
          "b25l"
        ],
        "name": "mlnet.Score.SlotNames"
      }
    ],
    "input": [
      {
        "name": "Label",
        "type": {
          "tensorType": {
            "elemType": 8,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Label.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "10"
                }
              ]
            }
          }
        }
      },
      {
        "name": "mlnet.Score.unusedOutput",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Features0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features1",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label0",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "LabelEncoderOutput",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "10"
                }
              ]
            }
          }
        }
      },
      {
        "name": "CastNodeOutput",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "10"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "11"
    }
  ]
}