{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Features"
        ],
        "output": [
          "Features0"
        ],
        "name": "Imputer",
        "opType": "Imputer",
        "attribute": [
          {
            "name": "replaced_value_float",
            "f": "NaN",
            "type": "FLOAT"
          },
          {
            "name": "imputed_value_floats",
            "floats": [
              0
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "Features1"
        ],
        "name": "Scaler",
        "opType": "Scaler",
        "attribute": [
          {
            "name": "offset",
            "floats": [
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "scale",
            "floats": [
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Label"
        ],
        "output": [
          "LabelEncoderOutput"
        ],
        "name": "LabelEncoder",
        "opType": "LabelEncoder",
        "attribute": [
          {
            "name": "keys_strings",
            "strings": [
              "NQ==",
              "Mw==",
              "Ng==",
              "NA==",
              "OA==",
              "MQ==",
              "Mg==",
              "Nw==",
              "MTA=",
              "OQ=="
            ],
            "type": "STRINGS"
          },
          {
            "name": "default_int64",
            "type": "INT"
          },
          {
            "name": "default_string",
            "s": "MA==",
            "type": "STRING"
          },
          {
            "name": "default_float",
            "type": "FLOAT"
          },
          {
            "name": "values_int64s",
            "ints": [
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "LabelEncoderOutput"
        ],
        "output": [
          "Label0"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "12",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Features1"
        ],
        "output": [
          "ClassifierLabelOutput",
          "Score"
        ],
        "name": "LinearClassifier",
        "opType": "LinearClassifier",
        "attribute": [
          {
            "name": "post_transform",
            "s": "U09GVE1BWA==",
            "type": "STRING"
          },
          {
            "name": "multi_class",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "coefficients",
            "floats": [
              -0.03167667,
              0.143471345,
              0.712303758,
              0.352516025,
              -0.301202744,
              -0.741327,
              0,
              -0.50539434,
              -0.495568782,
              -1.18026292,
              0,
              0,
              -0.498504966,
              -0.0420997739,
              -0.613307,
              0,
              0.607902765,
              0,
              0.141199484,
              0,
              0,
              0.211812049,
              0.7400253,
              0,
              0,
              -0.6818558,
              0,
              -0.551549,
              -0.696967065,
              0.160799474,
              -0.330957055,
              -0.2750144,
              1.0280081,
              0.88234216,
              0,
              0,
              0.6424018,
              0,
              0.8743826,
              0,
              -1.70732152,
              -1.191878,
              -0.5418798,
              -0.600155354,
              -0.740290344,
              -0.674283,
              -0.7527394,
              0,
              -0.5712943,
              -1.04777157,
              -0.226992026,
              0,
              -0.706178248,
              -0.145423546,
              -0.465133369,
              0,
              0,
              0,
              0.7297528,
              0,
              1.16632056,
              0.311890721,
              0.247274086,
              0.102029644,
              0.955604,
              0.9211974,
              0,
              0,
              1.15463662,
              0.6863172,
              0,
              0.35739857,
              0.51222384,
              1.30172575,
              0,
              0.8770747,
              0.0631457046,
              0,
              0.184382111,
              0.289009124
            ],
            "type": "FLOATS"
          },
          {
            "name": "intercepts",
            "floats": [
              1.24280047,
              1.713405,
              -0.833424449,
              1.31703234,
              -1.520917,
              2.636808,
              1.016353,
              -1.69996321,
              -1.4401859,
              -2.43189263
            ],
            "type": "FLOATS"
          },
          {
            "name": "classlabels_ints",
            "ints": [
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9",
              "10"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "ClassifierLabelOutput"
        ],
        "output": [
          "CastNodeOutput"
        ],
        "name": "Unsqueeze",
        "opType": "Unsqueeze",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "CastNodeOutput"
        ],
        "output": [
          "PredictedLabel"
        ],
        "name": "Cast0",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "12",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Label0"
        ],
        "output": [
          "Label.output"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "Features1"
        ],
        "output": [
          "Features.output"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "PredictedLabel"
        ],
        "output": [
          "PredictedLabel.output"
        ],
        "name": "Identity1",
        "opType": "Identity"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "Score.output"
        ],
        "name": "Identity2",
        "opType": "Identity"
      },
      {
        "input": [
          "mlnet.Score.SlotNames"
        ],
        "output": [
          "mlnet.Score.unusedOutput"
        ],
        "name": "mlnet.Score.SlotNames",
        "opType": "LabelEncoder",
        "attribute": [
          {
            "name": "keys_strings",
            "strings": [
              "NQ==",
              "Mw==",
              "Ng==",
              "NA==",
              "OA==",
              "MQ==",
              "Mg==",
              "Nw==",
              "MTA=",
              "OQ=="
            ],
            "type": "STRINGS"
          },
          {
            "name": "values_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4",
              "5",
              "6",
              "7",
              "8",
              "9"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      }
    ],
    "name": "model",
    "initializer": [
      {
        "dims": [
          "1",
          "1"
        ],
        "dataType": 8,
        "stringData": [
          "b25l"
        ],
        "name": "mlnet.Score.SlotNames"
      }
    ],
    "input": [
      {
        "name": "Label",
        "type": {
          "tensorType": {
            "elemType": 8,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Label.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "10"
                }
              ]
            }
          }
        }
      },
      {
        "name": "mlnet.Score.unusedOutput",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Features0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features1",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label0",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "LabelEncoderOutput",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "10"
                }
              ]
            }
          }
        }
      },
      {
        "name": "CastNodeOutput",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "8"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "10"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "11"
    }
  ]
}