{
  "irVersion": "3",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "Onnx",
  "graph": {
    "node": [
      {
        "input": [
          "Cat"
        ],
        "output": [
          "LabelEncodedInput"
        ],
        "name": "LabelEncoder",
        "opType": "LabelEncoder",
        "attribute": [
          {
            "name": "classes_strings",
            "strings": [
              "YmVuJmplcnJ5cw==",
              "bWFuL3dvbWFu",
              "cGxldGhvcmE=",
              "ZG9tYWlucw==",
              "JDY1MA==",
              "I3NhdWRp",
              "cmVzcGl0ZQ==",
              "c3VwZXJfc3BvdHRlcg==",
              "Y3VyYXRl",
              "Y2hlZXNjYWtl"
            ],
            "type": "STRINGS"
          },
          {
            "name": "default_int64",
            "i": "10",
            "type": "INT"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "LabelEncodedInput",
          "NotFoundValueComp"
        ],
        "output": [
          "NotFoundValuesBool"
        ],
        "name": "Equal",
        "opType": "Equal"
      },
      {
        "input": [
          "NotFoundValuesBool"
        ],
        "output": [
          "NotFoundValuesFloat"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "NotFoundValuesFloat"
        ],
        "output": [
          "ScaleMax"
        ],
        "name": "Scale",
        "opType": "Scale",
        "attribute": [
          {
            "name": "scale",
            "f": 2,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "NotFoundValuesBool"
        ],
        "output": [
          "CastMin"
        ],
        "name": "Cast0",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "ScaleMax"
        ],
        "output": [
          "CastMax"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "LabelEncodedInput",
          "CastMin"
        ],
        "output": [
          "AddMin"
        ],
        "name": "Add",
        "opType": "Add"
      },
      {
        "input": [
          "LabelEncodedInput",
          "CastMax"
        ],
        "output": [
          "AddMax"
        ],
        "name": "Add0",
        "opType": "Add"
      },
      {
        "input": [
          "WordEmbeddingWeights",
          "AddMin"
        ],
        "output": [
          "GatheredMin"
        ],
        "name": "Gather",
        "opType": "Gather"
      },
      {
        "input": [
          "WordEmbeddingWeights",
          "AddMax"
        ],
        "output": [
          "GatheredMax"
        ],
        "name": "Gather0",
        "opType": "Gather"
      },
      {
        "input": [
          "GatheredMin"
        ],
        "output": [
          "MinWeights"
        ],
        "name": "ReduceMin",
        "opType": "ReduceMin",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "0"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "GatheredMax"
        ],
        "output": [
          "MaxWeights"
        ],
        "name": "ReduceMax",
        "opType": "ReduceMax",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "0"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "WordEmbeddingWeights",
          "LabelEncodedInput"
        ],
        "output": [
          "GatheredMean"
        ],
        "name": "Gather1",
        "opType": "Gather"
      },
      {
        "input": [
          "GatheredMean"
        ],
        "output": [
          "SumWeights"
        ],
        "name": "ReduceSum",
        "opType": "ReduceSum",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "0"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "NotFoundValuesBool"
        ],
        "output": [
          "FoundValuesBool"
        ],
        "name": "Not",
        "opType": "Not"
      },
      {
        "input": [
          "FoundValuesBool"
        ],
        "output": [
          "FoundValuesInt"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "FoundValuesInt"
        ],
        "output": [
          "NumWordsFoundInt"
        ],
        "name": "ReduceSum0",
        "opType": "ReduceSum",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "0"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "NumWordsFoundInt"
        ],
        "output": [
          "NumWordsFoundFloat"
        ],
        "name": "Cast3",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "NumWordsFoundFloat"
        ],
        "output": [
          "NumWordsClippedFloat"
        ],
        "name": "Clip",
        "opType": "Clip",
        "attribute": [
          {
            "name": "min",
            "f": 1,
            "type": "FLOAT"
          }
        ]
      },
      {
        "input": [
          "SumWeights",
          "NumWordsClippedFloat"
        ],
        "output": [
          "MeanWeights"
        ],
        "name": "Div",
        "opType": "Div"
      },
      {
        "input": [
          "MinWeights",
          "MeanWeights",
          "MaxWeights"
        ],
        "output": [
          "Cat0"
        ],
        "name": "Concat",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Cat0"
        ],
        "output": [
          "Cat1"
        ],
        "name": "Identity",
        "opType": "Identity"
      }
    ],
    "name": "WordEmbeddings",
    "initializer": [
      {
        "dims": [
          "13",
          "50"
        ],
        "dataType": "FLOAT",
        "floatData": [
          0.06056195,
          -0.2956958,
          -0.3329707,
          -0.08342408,
          0.2266738,
          0.3667509,
          0.1217181,
          -0.01293143,
          0.1989859,
          -0.5650029,
          -0.1173989,
          -0.1446338,
          0.06299604,
          -0.4714805,
          0.04050945,
          0.1674304,
          -0.06149217,
          -0.186399,
          0.3262783,
          0.4574331,
          -0.489523,
          0.2341822,
          -0.05998896,
          -0.6204969,
          -0.1351632,
          -0.2795166,
          0.1296318,
          -0.04296121,
          0.1513352,
          -0.4697835,
          -0.005150698,
          -0.08828815,
          0.02642433,
          -0.2097927,
          -0.1642731,
          0.1007719,
          0.1351495,
          0.3233438,
          -0.05522937,
          -0.3999634,
          0.2570507,
          -0.194947,
          0.380419,
          0.3511596,
          0.1055673,
          -0.0228639,
          -0.07094942,
          -0.03870409,
          0.1794496,
          -0.2325044,
          -0.2857258,
          -0.4061431,
          -0.4659408,
          -0.1772058,
          0.8170841,
          -0.2240038,
          0.2024713,
          0.3339087,
          0.2676489,
          -0.3520035,
          -0.2897501,
          -0.03046888,
          -0.2576466,
          -0.7816175,
          -0.02404809,
          0.07703484,
          -0.02066584,
          -0.2262551,
          0.59022,
          -0.008925701,
          -0.233672,
          0.1339363,
          -0.09263906,
          -0.1363039,
          0.1631607,
          -0.3635361,
          -0.08579585,
          -0.3019876,
          0.1521418,
          -0.3211185,
          -0.02867044,
          -0.07400077,
          -0.1283412,
          -0.2055219,
          0.05832163,
          0.316001,
          0.1263286,
          0.1757049,
          0.09267411,
          -0.2418685,
          0.5184864,
          -0.02894363,
          0.4741932,
          0.09667222,
          0.1284083,
          0.1933668,
          0.1956903,
          -0.2553052,
          -0.1233553,
          -0.5535538,
          -0.5209064,
          -0.2064835,
          -0.4240961,
          -0.5953415,
          0.08970231,
          -0.4861407,
          0.4792427,
          -0.3243524,
          0.3917284,
          -0.2256264,
          0.05943196,
          -0.3909626,
          0.5631419,
          0.2785783,
          -0.2582215,
          -0.1793939,
          0.07886588,
          -0.4477122,
          0.02007042,
          0.3005448,
          0.2464366,
          -0.08012666,
          0.124767,
          -0.5018348,
          0.04689688,
          -0.5186401,
          0.2818623,
          0.1809776,
          -0.2430498,
          0.01580581,
          -0.1898526,
          0.4369849,
          0.5256151,
          0.2434542,
          -0.242722,
          -0.08663802,
          -0.2059001,
          -0.2475494,
          -0.1655112,
          -0.4452173,
          0.3057096,
          0.1211969,
          -0.01451813,
          -0.3987806,
          -0.06580366,
          0.6532359,
          0.195245,
          0.4492294,
          0.2211257,
          0.6017447,
          -0.08998915,
          -0.03108275,
          -0.2450103,
          -0.1068835,
          -0.4989476,
          -0.2654711,
          -0.2446562,
          0.06913802,
          0.5196419,
          -0.1399332,
          -0.1168308,
          -0.06979747,
          0.3274606,
          0.5516559,
          0.05246838,
          0.05095132,
          -0.2119478,
          -0.3593904,
          0.2124391,
          -0.1907797,
          -0.5444255,
          -0.006616622,
          0.07915849,
          -0.001369868,
          0.3803919,
          -0.4178859,
          0.7166966,
          0.4360946,
          0.4832194,
          0.006898207,
          -0.2854649,
          0.0005391084,
          0.04278877,
          -0.4854246,
          -0.1888678,
          -0.09056192,
          0.0422965,
          0.339817,
          -0.7541263,
          0.0297113,
          0.2456963,
          0.275519,
          -0.3809604,
          -0.03465085,
          0.4928685,
          0.2980544,
          -0.4223129,
          0.4022578,
          0.05093821,
          -0.465828,
          0.2829988,
          -0.09087696,
          -0.6910918,
          -0.1360347,
          0.08780884,
          -0.2449317,
          0.0408463,
          0.0468285,
          -0.1262327,
          -0.693096,
          -0.8380013,
          0.2073797,
          -0.04078698,
          -0.4974256,
          0.282456,
          0.6621229,
          -0.1232237,
          0.1391797,
          -0.1933332,
          0.03968713,
          -0.5447156,
          -0.1141197,
          -0.2804459,
          -0.468702,
          0.02381325,
          -0.5162231,
          -0.0952291,
          0.1706163,
          0.4412287,
          -0.4687499,
          0.2562787,
          -0.4877442,
          -0.324715,
          -0.1711924,
          0.1602967,
          -0.3330307,
          0.02238004,
          0.5134764,
          -0.3592561,
          -0.2650043,
          0.2662211,
          -0.1541223,
          0.1316032,
          0.1523172,
          0.1329686,
          0.0541753,
          -0.1615777,
          -0.1832436,
          0.3738795,
          -0.3862813,
          0.04731387,
          0.25671,
          -0.123085,
          -0.008305848,
          0.2257719,
          0.1636093,
          0.1491391,
          0.1283572,
          0.3756095,
          -0.6452251,
          -0.534063,
          -0.109263,
          0.3193423,
          0.2017284,
          -0.0564172,
          0.4154128,
          0.09646778,
          -0.003892163,
          0.3229214,
          0.2004433,
          -0.4228642,
          -0.03675835,
          -0.4513536,
          -0.06335346,
          -0.1522399,
          -0.1196307,
          0.1874174,
          0.139172,
          0.1930041,
          -0.1793251,
          0.01547365,
          0.1113704,
          0.1346746,
          -0.1276237,
          0.01315232,
          -0.01382291,
          0.1330934,
          0.1282476,
          -0.119266,
          -0.2786174,
          0.1952397,
          0.07895324,
          0.1535987,
          0.2821256,
          0.1847679,
          -0.1173458,
          0.07284809,
          -0.139777,
          -0.02916925,
          -0.255299,
          -0.4788561,
          0.02185175,
          -0.3275368,
          -0.3840315,
          -0.431399,
          -0.6895878,
          0.02497269,
          0.03790089,
          0.6263114,
          -0.06515428,
          -0.08082591,
          -0.1919853,
          1.158483,
          0.1889719,
          -0.05914751,
          0.1730902,
          0.3796347,
          0.004735549,
          0.14946,
          0.07179955,
          -0.02855177,
          -0.05370219,
          -0.02352832,
          -0.3489005,
          -0.1037789,
          -1.288182,
          0.9789649,
          0.1535683,
          0.6705098,
          -0.1449302,
          -0.9013238,
          0.5640278,
          0.4523375,
          0.0612951,
          -0.3770716,
          -0.3933798,
          -0.09920849,
          -0.02765506,
          -0.07978132,
          -0.07115675,
          0.5215462,
          0.4764206,
          -0.3070676,
          0.05070348,
          -0.1478988,
          0.09054291,
          0.06704061,
          0.6186543,
          -0.1872993,
          0.724771,
          1.03452,
          0.3533396,
          -0.2406918,
          0.4335831,
          0.7959734,
          0.2265452,
          0.2646276,
          0.2451806,
          0.3583839,
          -0.4308875,
          0.01309887,
          0.1147801,
          -0.9748943,
          -0.2982324,
          0.270472,
          1.309276,
          -0.5289592,
          -0.1661386,
          -0.03899348,
          -0.1979776,
          -0.5894765,
          0.02458745,
          -1.034382,
          -0.3320844,
          -0.0817119,
          0.5962685,
          0.04992925,
          0.06047925,
          -0.1251493,
          -0.2455514,
          0.8026267,
          -0.494703,
          -0.1634797,
          -0.354952,
          0.9375566,
          0.1293375,
          0.01086773,
          0.7265397,
          0.3893842,
          -1.043247,
          0.006954132,
          -0.4861025,
          0.2383302,
          -0.1963707,
          0.4191644,
          0.7224011,
          -0.9885011,
          -0.09403978,
          0.3530708,
          -0.9621412,
          -0.6622372,
          -0.3526042,
          -0.1821924,
          -0.09206834,
          -0.5822163,
          -0.6323017,
          0.4249782,
          -0.001607583,
          0.6712393,
          -0.05217409,
          -0.2471348,
          -0.268968,
          1.223621,
          0.9050562,
          -0.2032172,
          -0.1121874,
          0.3183073,
          -0.3189175,
          0.1290292,
          0.05780738,
          0.1071477,
          -0.2173614,
          0.06872706,
          -0.2954995,
          -0.01635804,
          -0.8657081,
          0.4725526,
          0.3354404,
          -0.04650293,
          0.024712,
          -0.9264293,
          0.3168984,
          0.4959398,
          0.01609099,
          -0.4434522,
          -0.28705,
          -0.1908294,
          0.1395669,
          -0.1571958,
          0.1855657,
          0.5969362,
          0.5675817,
          -0.0699168,
          -0.2388696,
          -0.6736412,
          0.2304021,
          -0.0566838,
          0.6528829,
          0.04068363,
          0.7937787,
          -0.3883546,
          -0.2026145,
          -0.7408616,
          0.2163035,
          0.01324792,
          -0.2328682,
          0.3006133,
          0.02010366,
          0.338348,
          -0.06571625,
          -0.4233621,
          0.177592,
          0.1192251,
          -0.1180008,
          0.01449078,
          -0.105069,
          0.1435705,
          -0.3127167,
          0.3993926,
          0.225541,
          -0.1678828,
          0.1122161,
          -0.22772,
          -0.05286054,
          -0.06080053,
          -0.4789153,
          0.1738632,
          -0.1430698,
          0.2168731,
          0.08177216,
          -0.04686889,
          0.1602549,
          -0.1020556,
          0.1024229,
          0.09959106,
          0.4502393,
          0.2430318,
          0.6472189,
          -0.4000771,
          0.2313825,
          0.3174959,
          0.04927393,
          0.1835182,
          0.2913678,
          -0.1094415,
          0.2155183,
          0.2656501,
          0.1508634,
          -0.3700516,
          -0.3107388,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          0,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38,
          -3.40282347E+38
        ],
        "name": "WordEmbeddingWeights"
      },
      {
        "dataType": "INT64",
        "int64Data": [
          "10"
        ],
        "name": "NotFoundValueComp"
      }
    ],
    "input": [
      {
        "name": "Cat",
        "type": {
          "tensorType": {
            "elemType": "STRING",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Cat1",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "150"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Cat0",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "150"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "1"
    },
    {
      "version": "7"
    }
  ]
}