{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Features"
        ],
        "output": [
          "MissingIndicator"
        ],
        "name": "IsNaN",
        "opType": "IsNaN"
      },
      {
        "input": [
          "MissingIndicator"
        ],
        "output": [
          "MissingIndicator0"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Features"
        ],
        "output": [
          "Features.output"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "MissingIndicator0"
        ],
        "output": [
          "MissingIndicator.output"
        ],
        "name": "Identity0",
        "opType": "Identity"
      }
    ],
    "name": "model",
    "input": [
      {
        "name": "Features",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      },
      {
        "name": "MissingIndicator.output",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "MissingIndicator",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      },
      {
        "name": "MissingIndicator0",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      },
      {
        "name": "MissingIndicator.output",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "12"
    }
  ]
}