{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Size"
        ],
        "output": [
          "Size0"
        ],
        "name": "Imputer",
        "opType": "Imputer",
        "attribute": [
          {
            "name": "replaced_value_float",
            "f": "NaN",
            "type": "FLOAT"
          },
          {
            "name": "imputed_value_floats",
            "floats": [
              0
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Size0"
        ],
        "output": [
          "Size1"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "Shape"
        ],
        "output": [
          "Shape0"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "Thickness"
        ],
        "output": [
          "Thickness0"
        ],
        "name": "Identity1",
        "opType": "Identity"
      },
      {
        "input": [
          "Label"
        ],
        "output": [
          "Label0"
        ],
        "name": "Identity2",
        "opType": "Identity"
      },
      {
        "input": [
          "Size1"
        ],
        "output": [
          "Size.output"
        ],
        "name": "Identity3",
        "opType": "Identity"
      },
      {
        "input": [
          "Shape0"
        ],
        "output": [
          "Shape.output"
        ],
        "name": "Identity4",
        "opType": "Identity"
      },
      {
        "input": [
          "Thickness0"
        ],
        "output": [
          "Thickness.output"
        ],
        "name": "Identity5",
        "opType": "Identity"
      },
      {
        "input": [
          "Label0"
        ],
        "output": [
          "Label.output"
        ],
        "name": "Identity6",
        "opType": "Identity"
      }
    ],
    "name": "model",
    "input": [
      {
        "name": "Label",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Thickness",
        "type": {
          "tensorType": {
            "elemType": 11,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Size",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Shape",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Adhesion",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "EpithelialSize",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "BlandChromatin",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "NormalNucleoli",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Mitoses",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Size.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Shape.output",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Thickness.output",
        "type": {
          "tensorType": {
            "elemType": 11,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label.output",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Size0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Size1",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Shape0",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Thickness0",
        "type": {
          "tensorType": {
            "elemType": 11,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label0",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Size.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Shape.output",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Thickness.output",
        "type": {
          "tensorType": {
            "elemType": 11,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label.output",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "11"
    }
  ]
}