{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Size"
        ],
        "output": [
          "Size0"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "Shape"
        ],
        "output": [
          "Shape0"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "Thickness"
        ],
        "output": [
          "Thickness0"
        ],
        "name": "Identity1",
        "opType": "Identity"
      },
      {
        "input": [
          "Label"
        ],
        "output": [
          "Label0"
        ],
        "name": "Identity2",
        "opType": "Identity"
      },
      {
        "input": [
          "Size0"
        ],
        "output": [
          "Size1"
        ],
        "name": "Identity3",
        "opType": "Identity"
      },
      {
        "input": [
          "Shape0"
        ],
        "output": [
          "Shape1"
        ],
        "name": "Identity4",
        "opType": "Identity"
      },
      {
        "input": [
          "Thickness0"
        ],
        "output": [
          "Thickness1"
        ],
        "name": "Identity5",
        "opType": "Identity"
      },
      {
        "input": [
          "Label0"
        ],
        "output": [
          "Label1"
        ],
        "name": "Identity6",
        "opType": "Identity"
      }
    ],
    "name": "model",
    "input": [
      {
        "name": "Label",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Thickness",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Size",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Shape",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Size1",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Shape1",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Thickness1",
        "type": {
          "tensorType": {
            "elemType": 6,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Label1",
        "type": {
          "tensorType": {
            "elemType": 9,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "11"
    }
  ]
}