{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Features"
        ],
        "output": [
          "Features0"
        ],
        "name": "Scaler",
        "opType": "Scaler",
        "attribute": [
          {
            "name": "offset",
            "floats": [
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "scale",
            "floats": [
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "X2"
        ],
        "name": "ReduceSumSquare",
        "opType": "ReduceSumSquare",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "Features0",
          "C",
          "zero"
        ],
        "output": [
          "XC2"
        ],
        "name": "Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": -2,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "X2",
          "XC2"
        ],
        "output": [
          "Z"
        ],
        "name": "Add",
        "opType": "Add"
      },
      {
        "input": [
          "Z",
          "C2"
        ],
        "output": [
          "Score"
        ],
        "name": "Add0",
        "opType": "Add"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "ArgMinInt64"
        ],
        "name": "ArgMin",
        "opType": "ArgMin",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "keepdims",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "ArgMinInt64"
        ],
        "output": [
          "PredictedLabel"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "12",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "Features.output"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "PredictedLabel"
        ],
        "output": [
          "PredictedLabel.output"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "Score.output"
        ],
        "name": "Identity1",
        "opType": "Identity"
      }
    ],
    "name": "model",
    "initializer": [
      {
        "dims": [
          "4",
          "9"
        ],
        "dataType": 1,
        "floatData": [
          0.73333323,
          0.773563266,
          0.7666668,
          0.7390804,
          0.6931034,
          0.7586207,
          0.672413945,
          0.8724138,
          0.394252956,
          0.133742481,
          0.122086048,
          0.125153527,
          0.129448012,
          0.203681245,
          0.168098375,
          0.228834346,
          0.121472582,
          0.109816112,
          0.722656131,
          0.651562631,
          0.64453125,
          0.4921875,
          0.459374964,
          0.8523438,
          0.5828125,
          0.4265623,
          0.1773439,
          0.41082,
          0.146229282,
          0.163934156,
          0.147212848,
          0.224918276,
          0.129835978,
          0.212786645,
          0.149835765,
          0.113442831
        ],
        "name": "C"
      },
      {
        "dims": [
          "4"
        ],
        "dataType": 1,
        "floatData": [
          4.694775,
          0.214135692,
          3.09502673,
          0.3867459
        ],
        "name": "C2"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 1,
        "floatData": [
          0
        ],
        "name": "zero"
      }
    ],
    "input": [
      {
        "name": "Features",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Features0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "X2",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "XC2",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Z",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "12"
    }
  ]
}