{
  "irVersion": "3",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "Onnx",
  "graph": {
    "node": [
      {
        "input": [
          "Features"
        ],
        "output": [
          "Features0"
        ],
        "name": "Scaler",
        "opType": "Scaler",
        "attribute": [
          {
            "name": "offset",
            "floats": [
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "scale",
            "floats": [
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "X2"
        ],
        "name": "ReduceSumSquare",
        "opType": "ReduceSumSquare"
      },
      {
        "input": [
          "Features0",
          "C",
          "zero"
        ],
        "output": [
          "XC2"
        ],
        "name": "Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": -2,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "X2",
          "XC2"
        ],
        "output": [
          "Z"
        ],
        "name": "Add",
        "opType": "Add"
      },
      {
        "input": [
          "Z",
          "C2"
        ],
        "output": [
          "Score"
        ],
        "name": "Add0",
        "opType": "Add"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "PredictedLabel"
        ],
        "name": "ArgMin",
        "opType": "ArgMin",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "keepdims",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "Features1"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "PredictedLabel"
        ],
        "output": [
          "PredictedLabel0"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "Score0"
        ],
        "name": "Identity1",
        "opType": "Identity"
      }
    ],
    "name": "Kmeans",
    "initializer": [
      {
        "dims": [
          "2",
          "9"
        ],
        "dataType": "FLOAT",
        "floatData": [
          0.6232001,
          0.482400715,
          0.495733529,
          0.416533619,
          0.425866365,
          0.5456011,
          0.477333277,
          0.4338674,
          0.20399937,
          0.225407124,
          0.111400835,
          0.109446481,
          0.120521255,
          0.198697388,
          0.121824168,
          0.182410166,
          0.108143583,
          0.107166387
        ],
        "name": "C"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": "FLOAT",
        "floatData": [
          1.97708726,
          0.200497344
        ],
        "name": "C2"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": "FLOAT",
        "floatData": [
          0
        ],
        "name": "zero"
      }
    ],
    "input": [
      {
        "name": "Features",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Features1",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel0",
        "type": {
          "tensorType": {
            "elemType": "INT64",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score0",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "2"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Features0",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "1"
    },
    {
      "version": "7"
    }
  ]
}