{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Features"
        ],
        "output": [
          "Features0"
        ],
        "name": "Scaler",
        "opType": "Scaler",
        "attribute": [
          {
            "name": "offset",
            "floats": [
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "scale",
            "floats": [
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "X2"
        ],
        "name": "ReduceSumSquare",
        "opType": "ReduceSumSquare",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "Features0",
          "C",
          "zero"
        ],
        "output": [
          "XC2"
        ],
        "name": "Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": -2,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "X2",
          "XC2"
        ],
        "output": [
          "Z"
        ],
        "name": "Add",
        "opType": "Add"
      },
      {
        "input": [
          "Z",
          "C2"
        ],
        "output": [
          "Score"
        ],
        "name": "Add0",
        "opType": "Add"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "ArgMinInt64"
        ],
        "name": "ArgMin",
        "opType": "ArgMin",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "keepdims",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "ArgMinInt64"
        ],
        "output": [
          "PredictedLabel"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "12",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "Features.output"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "PredictedLabel"
        ],
        "output": [
          "PredictedLabel.output"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "Score.output"
        ],
        "name": "Identity1",
        "opType": "Identity"
      }
    ],
    "name": "model",
    "initializer": [
      {
        "dims": [
          "4",
          "9"
        ],
        "dataType": 1,
        "floatData": [
          0.457777977,
          0.123703845,
          0.117777869,
          0.14888905,
          0.220741019,
          0.122963116,
          0.186666891,
          0.117037192,
          0.104444563,
          0.72767,
          0.710194349,
          0.6951457,
          0.612621367,
          0.5631069,
          0.817475855,
          0.623301,
          0.62330085,
          0.272329777,
          0.182692185,
          0.1123079,
          0.115769453,
          0.116923265,
          0.190769538,
          0.12615411,
          0.1984614,
          0.11000023,
          0.107692547,
          0.5395061,
          0.282716125,
          0.374073982,
          0.2037038,
          0.312345773,
          0.29876554,
          0.367901236,
          0.285185337,
          0.138271689
        ],
        "name": "C"
      },
      {
        "dims": [
          "4"
        ],
        "dataType": 1,
        "floatData": [
          0.384200335,
          3.72893953,
          0.188455641,
          0.9750436
        ],
        "name": "C2"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 1,
        "floatData": [
          0
        ],
        "name": "zero"
      }
    ],
    "input": [
      {
        "name": "Features",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Features0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "X2",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "XC2",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Z",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Features.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel.output",
        "type": {
          "tensorType": {
            "elemType": 12,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "11"
    }
  ]
}