{
  "irVersion": "3",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "Features"
        ],
        "output": [
          "Features0"
        ],
        "name": "Scaler",
        "opType": "Scaler",
        "attribute": [
          {
            "name": "offset",
            "floats": [
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0,
              0
            ],
            "type": "FLOATS"
          },
          {
            "name": "scale",
            "floats": [
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1,
              0.1
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "X2"
        ],
        "name": "ReduceSumSquare",
        "opType": "ReduceSumSquare"
      },
      {
        "input": [
          "Features0",
          "C",
          "zero"
        ],
        "output": [
          "XC2"
        ],
        "name": "Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": -2,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "X2",
          "XC2"
        ],
        "output": [
          "Z"
        ],
        "name": "Add",
        "opType": "Add"
      },
      {
        "input": [
          "Z",
          "C2"
        ],
        "output": [
          "Score"
        ],
        "name": "Add0",
        "opType": "Add"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "PredictedLabel"
        ],
        "name": "ArgMin",
        "opType": "ArgMin",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "keepdims",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "Features0"
        ],
        "output": [
          "Features1"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "PredictedLabel"
        ],
        "output": [
          "PredictedLabel0"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "Score0"
        ],
        "name": "Identity1",
        "opType": "Identity"
      }
    ],
    "name": "model",
    "initializer": [
      {
        "dims": [
          "4",
          "9"
        ],
        "dataType": "FLOAT",
        "floatData": [
          0.690322459,
          0.948387,
          0.835483849,
          0.9129032,
          0.7741936,
          0.7709678,
          0.729032159,
          0.606451631,
          0.6161291,
          0.473529756,
          0.15147081,
          0.1705884,
          0.144608051,
          0.220098346,
          0.13627474,
          0.206372589,
          0.140686512,
          0.1176473,
          0.7130001,
          0.6315002,
          0.646,
          0.5310001,
          0.5105002,
          0.7975002,
          0.5864999,
          0.599499941,
          0.19799982,
          0.171255022,
          0.115384832,
          0.119838275,
          0.118218832,
          0.20121488,
          0.124696605,
          0.214574754,
          0.115384884,
          0.108097412
        ],
        "name": "C"
      },
      {
        "dims": [
          "4"
        ],
        "dataType": "FLOAT",
        "floatData": [
          5.380062,
          0.440423042,
          3.245642,
          0.198056549
        ],
        "name": "C2"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": "FLOAT",
        "floatData": [
          0
        ],
        "name": "zero"
      }
    ],
    "input": [
      {
        "name": "Features",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "Features1",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      },
      {
        "name": "PredictedLabel0",
        "type": {
          "tensorType": {
            "elemType": "INT64",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score0",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Features0",
        "type": {
          "tensorType": {
            "elemType": "FLOAT",
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "9"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "1"
    },
    {
      "version": "7"
    }
  ]
}