{
  "irVersion": "6",
  "producerName": "ML.NET",
  "producerVersion": "##VERSION##",
  "domain": "machinelearning.dotnet",
  "graph": {
    "node": [
      {
        "input": [
          "FeatureVector"
        ],
        "output": [
          "LinearRegressorOutput"
        ],
        "name": "LinearRegressor",
        "opType": "LinearRegressor",
        "attribute": [
          {
            "name": "post_transform",
            "s": "Tk9ORQ==",
            "type": "STRING"
          },
          {
            "name": "targets",
            "i": "1",
            "type": "INT"
          },
          {
            "name": "coefficients",
            "floats": [
              0.2037472,
              0.005167962,
              0.1929681,
              0.01041878,
              -0.000658446748,
              0.00338159036,
              0.0447585769,
              0.00602663541,
              0.00161118619,
              -0.00189642713,
              0.2229219
            ],
            "type": "FLOATS"
          },
          {
            "name": "intercepts",
            "floats": [
              5.86058044
            ],
            "type": "FLOATS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "LinearRegressorOutput"
        ],
        "output": [
          "Score"
        ],
        "name": "Exp",
        "opType": "Exp"
      },
      {
        "input": [
          "FeatureVector"
        ],
        "output": [
          "FeatureVector.output"
        ],
        "name": "Identity",
        "opType": "Identity"
      },
      {
        "input": [
          "Target"
        ],
        "output": [
          "Target.output"
        ],
        "name": "Identity0",
        "opType": "Identity"
      },
      {
        "input": [
          "Score"
        ],
        "output": [
          "Score.output"
        ],
        "name": "Identity1",
        "opType": "Identity"
      }
    ],
    "name": "model",
    "input": [
      {
        "name": "FeatureVector",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "11"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Target",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "FeatureVector.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "11"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Target.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "Score",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "FeatureVector.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "11"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Target.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Score.output",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "-1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": "2"
    },
    {
      "version": "11"
    }
  ]
}